import 'package:flutter/material.dart';

class PrivacyPolicyPage extends StatelessWidget {
  const PrivacyPolicyPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('プライバシーポリシー'),
      ),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: SingleChildScrollView(
            child: Text('''
                 プライバシーポリシー 
           
          本プライバシーポリシー（以下「本ポリシー」といいます。）は趙聖化、播磨颯太、久保田翔、城柾芳、足立遼太朗、今川航介、谷後七菜花が立ち上げたチームであるCampusTime（以下、「当チーム」といいます。）が提供する全てのサービス（以下「本サービス」といいます。）のプライバシーポリシーを定めるものであり、本サービスを利用する全てのユーザーに適用されます。 
           
          本サービスの利用に際しては、本ポリシーの全文をお読みいただいた上で、本ポリシーに同意していただく必要があります。 
           
          個人情報の定義 
          (1) CampusTimeでは、個人情報について、ユーザー個人に関する情報であって、当該情報を構成するユーザーの氏名、学校・学部・学科名、年齢、メールアドレス、性別、生年月日、位置情報（市or区まで）、投稿内容、ユーザーが利用するその他の識別子（アプリ内で使用されるニックネームなど）。により当該ユーザー個人を識別できる情報とします。 
           
          個人情報の適正な取得 
          (1) CampusTimeは、利用目的の達成に必要な個人情報を適正に取得し、偽りその他の不正の手段によって取得することはありません。 
          (2) ユーザーは、CampusTimeが求める全ての情報をご提供いただく必要があります。 
           
          事業者の名称・住所・代表者氏名 
          名称：CampusTime 
          住所：〒650-0013　神戸市中央区花隈町33-23,804号 
          代表者氏名：趙聖化（チョ・ソンファ） 
           
          個人情報の利用目的 
          (1) CampusTimeは、個人情報の取得に際して、お知らせした利用目的または以下の目的のために取得した情報を利用します。 
          (2) なお、ご本人の同意がある場合及び個人情報保護法その他の個人情報に関する法令により認められる場合を除いては、この範囲を超えて個人情報を利用することはありません。 
          　A.　CampusTimeにおけるユーザーの個人認証 
          　B.　CampusTimeにおけるユーザーへのサービスの提供 
          　C.　商品広告を提供する企業等への会員サービスを目的とした情報提供 
          　D.　CampusTimeによるサービスの向上等を目的としたアンケート、キャンペーンの実施 
          　E.　CampusTimeからのメールによる各種情報の無料提供、お問い合わせへの返答 
          　F.　利用規約に違反する態様、スパム行為、不正アクセス等の不正利用の防止 
          　G.　アクセス状況の把握、ニーズに適したサービスの提供ならびに改善 
          　H.　CampusTime及び第三者の広告の配信または表示 
           
          個人情報の第三者提供 
          (1) CampusTimeは、以下に記載する場合を除き、原則として、ユーザーご本人の同意を得ずに個人情報を第三者に提供しません。 
          　A.　法令に基づく場合 
          　B.　人の生命、身体又は財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき 
          　C.　公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき 
          　D.　国の機関若しくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき 
          　E.　利用目的の達成に必要な範囲内において、個人データの取扱いの全部又は一部を委託する場合 
          　F.　本サービスのサービス向上の目的で個人情報を集計及び分析により得られたものを、個人を識別又は特定できない態様にて提携先等第三者に開示又は提供する場合 
          　G.　商品広告を提供する企業等への会員サービスを目的とした情報提供 
          　H.　広告の配信または表示を目的とした利用 
          　I.　本サービスの全部または一部の営業譲渡が行われ、譲渡先に対して法的に権利義務一切が引き継がれる場合 
           
          個人情報の安全管理 
          (1) CampusTimeは、個人情報の漏えい、減失又は毀損の防止その他の安全管理のための措置を講じるとともに、CampusTimeの従業員に対する教育を行い、個人情報保護を徹底します。 
           
          個人情報の変更等 
          (1) ユーザーは、CampusTimeに対し、登録した個人情報が真実でない（追加・変更によって真実でなくなった場合を含みます。）という理由によって、その内容の変更・追加を請求することができ、CampusTimeは、当該請求がユーザー本人の請求であることを確認の上、必要な調査を行い、遅滞なくこれを追加・変更します。 
          (2) ただし、CampusTimeが合理的理由に基づき、変更・追加を行わない場合、ユーザーに対してその旨を通知することとします。 
          (3) また、ユーザーは、CampusTimeに対し、登録した個人情報の削除を請求することができ、CampusTimeは、当該請求がユーザー本人の請求であることを確認の上、当該ユーザーの請求に応じる必要があると判断した場合、これを削除します。 
           
          個人情報の利用目的の通知、開示、利用停止等の求め 
          (1) CampusTimeは、利用目的の通知、個人情報又は第三者提供記録の開示、個人情報の利用停止若しくは消去、又は第三者への提供の停止について、下記のお問い合わせ窓口にて受け付けています。 
          (2) ご本人からのお申出があった場合には、お申出いただいた方がご本人又はその代理人であることを確認のうえ、法令の定めに従い対応し、書面又はメールにて回答いたします。 
          (3) なお、お申出が法令の定める要件を充たさない場合、又は、個人情報保護法その他の法令により、開示等を拒絶することが認められる事由がある場合には、お申出に添えないことがあります。 
           
          お問い合わせ窓口 
          (1) 開示等のお申出、ご意見、ご質問、苦情、その他個人情報の取り扱いに関するお問い合わせは、お問い合わせフォームよりご連絡ください。 
           
          免責 
          (1) 以下の場合は、第三者による個人情報の取得に関し、CampusTimeは何らの責任を負いません。 
          　A.　ユーザー自らがCampusTime上の機能または別の手段を用いて他のユーザーに個人情報を明らかにした場合 
          　B.　ユーザー自らが入力した情報またはその他のユーザーが入力した情報により、期せずして本人が特定できてしまった場合 
          　C.　ご本人以外のユーザーが個人を識別できる情報（ID、パスワード等）を入手した場合 
           
          cookie（クッキー）等の使用 
          (1) CampusTimeは、より良いサービスを提供するため、cookieや広告識別子、ハッシュ化されたユーザー情報、アクセス履歴、端末やアプリの情報など（以下「cookie等」といいます）を使用することがありますが、これにより個人を特定できる情報の収集を行えるものではなく、ユーザーのプライバシーを侵害することはありません。 
          (2) また、cookie等の受け入れを希望しない場合は、ブラウザの設定で変更することができます。 
          (3) cookieとは、サーバーコンピュータからユーザーのブラウザに送信され、ユーザーが使用しているコンピュータのハードディスクに蓄積される情報です。 
          (4) また、当社サービスでは、当社が委託する広告配信事業者のサーバーからクッキー等を使用したターゲティング広告の配信が行われる場合があります。 
          (5) これらの広告配信事業者がクッキー等を使用した広告配信を行っている場合には、自動的に取得された情報が広告配信事業者のサーバーに記録され、広告配信事業者のプライバシーポリシーのもとで管理されます。 
          (6) 各社のプライバシーポリシーおよびオプトアウトの手順については、以下の表から確認してください。 
           
           
          端末識別子の使用 
          (1) CampusTimeは、iOS版・Android版アプリを利用するスマートデバイス端末から端末識別子（Apple社が発行するIDFAやGoogle社が発行するAAID等の広告識別子を含みます。）を取得し使用することがあります。 
           
          位置情報の使用 
          (1) CampusTimeは、ユーザーがCampusTimeを利用する際のユーザーの位置情報（緯度経度情報）を、ユーザーの同意がある場合に取得し使用することがあります。 
           
          サービス内での行動情報の使用 
          (1) CampusTimeは、ユーザーがCampusTimeを利用されている際の検索条件や、投稿・問合せ内容などお客様がサービス内で行った行動の情報を取得し使用することがあります。 
           
          アクセスログ等の記録、開示 
          (1) CampusTimeは、CampusTimeにメッセージ等の書き込みを行ったユーザーのIPアドレス、当該IPアドレスからCampusTimeに書き込みを行った日時等のアクセスログを記録することがあります。 
          (2) CampusTimeは、ユーザーが開示に同意した場合、犯罪捜査など法律手続の中で開示を要請された場合又は消費者センター、弁護士会等の公的機関から正当な理由に基づき照会を受けた場合の他、CampusTimeになされた書き込み等により損害を被ったと主張する第三者から開示を要請された場合において、当該書き込みを行ったユーザーの氏名、電子メールアドレスなどの個人情報及びアクセスログを開示することがあります。 
           
          統計データの利用 
          (1) CampusTimeは、提供を受けた個人情報をもとに、個人を特定できない形式による統計データを作成し、当該データにつき何らの制限なく利用することができるものとします。 
           
          プライバシーポリシーの変更 
          (1) 当チームは、法、規制または運用上の要件変更に応じて随時、本ポリシーを更新します。(2) かかる変更を行う場合には、法に従って通知（変更の効力発生時を含みます）を行います。 
          (3) かかる更新が行われ、ユーザーが更新の効力発生後も本サービスの利用を継続された場合には、ユーザーは変更を確認し（該当する場合）承諾したものとします。 
          (4) 本ポリシーの更新を承諾されない場合、本サービスの使用を解約することができます。(5) 本ポリシーの直近の更新を確認するには、下記「最終更新」セクションをご参照ください。 
           
          最終更新 
          【2024年4月20日】 
           
                  '''),
          ),
        ), // 이곳에 이용 계약 내용을 넣으세요.
      ),
    );
  }
}
