import 'package:flutter/material.dart';

class TermsOfServicePage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('利用規約'),
      ),
      body: const Padding(
        padding: EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Text('''
                  利用規約 
           
          本利用規約（以下「本規約」といいます。）は趙聖化、播磨颯太、久保田翔、城柾芳、足立遼太朗、島悠人、今川航介、谷後七菜花が立ち上げたチームであるCampusTime（以下、「当チーム」といいます。）が提供する全てのサービス（以下「本サービス」といいます。）の利用条件を定めるものであり、本サービスを利用する全てのユーザーに適用されます。 
           
          本サービスの利用に際しては、本規約の全文をお読みいただいた上で、本規約に同意していただく必要があります。 
          第1章　総則 
          第1.1条（規約の適用） 
          (1) 本規約は、当チームが提供するサービスである本サービスの利用に対して適用されます。以下、本サービスを利用する者を「ユーザー」といいます。 
          (2) 利用規約に同意しない限り、ユーザーはCampusTime（以下、「本アプリケーション」といいます。）を利用することができません。 
          (3) ユーザーが情報端末にダウンロードした本アプリケーションを現実に利用した場合、ユーザーは利用規約に同意したものとみなされます。 
          (4) ユーザーは、利用規約の定めに従って、本アプリケーションを利用するものとします。 
          第1.2条（本規約の変更） 
          (1) 当チームは、本サービスの運営上の都合その他当チームが必要と判断する場合には、随時、本規約を変更することができます。この場合に、本サービスの利用条件は、変更後の本規約によるものとします。 
          (2) 変更後の本規約は、当チームが別途定める場合を除き、本サービス上に表示した時点より効力を生じるものとします。当該変更後、ユーザーが本サービスを利用した場合、ユーザーは、本規約の変更に同意したものとみなします。 
          (3) ただし、法令上、ユーザーの同意が必要となるような内容の変更の場合は、当チーム所定の方法でユーザーの同意を得るものとします。 
          第1.3条（当チームからの連絡方法） 
          (1) 本アプリケーションに関する当チームからユーザーへの連絡は、本アプリケーション内への掲示やその他当チームが適当と判断する方法により行います。 
          (2) 本アプリケーションケーションに関するユーザーから当チームへの連絡は、本アプリケーション内に設置する「お問い合わせフォーム」を通じて行うものとします。 
          (3) 本サービスに関する問い合わせやその他ユーザーから当チームに対する連絡または通知、及び本規約の変更に関する通知、その他当チームからユーザーに対する連絡または通知は、当チームが適当と判断する方法で行うものとします。 
          (4) 当チームが登録事項に含まれるメールアドレスその他の連絡先に連絡または通知を行った場合、登録ユーザーは当該連絡または通知を受領したものとみなします。 
          第1.4条（本サービスの利用） 
          (1) ユーザーは、本サービスの利用にあたり、本規約を遵守するものとします。 
          (2) 本サービスの内容は、ユーザー間のテキスト売買やユーザー間のメッセージのやり取り、授業評価に関する投稿、掲示板、学割情報発信、課外イベント情報発信である。 
          (3) ユーザーは、当チームが別途定める投稿・取引ガイドラインその他のガイドライン、当チームからの通知を確認・理解した上で、これらに従って投稿等を行い、本サービスを利用するものとします。 
          (4) 当チームは、当チームが必要と考える場合、本サービスの内容を自由に変更することができるものとし、ユーザーはこれを了承した上で、本サービスを利用するものとします。 
          第1.5条（本アプリケーション利用条件） 
          (1) 未成年者は本アプリケーションを利用することができません。 
          (2) 日本国外にて本アプリケーションを利用することはできません。 
          (3) ユーザーは、本アプリケーションを利用するに際し、情報端末（デバイス）、通信機器・手段、電力等をユーザー自らの責任と負担で準備・用意し、本アプリケーション利用中は維持しなければならないものとします。 
          (4) ユーザーは、当チームが定める仕様基準（対応するOS、性能、機能等を含みますが、これらに限られません）に従わない限り、本アプリケーションを利用できない場合があることを予め了承します。 
          第1.6条（登録） 
          (1) 本サービスへの登録を希望する者（以下、「登録希望者」といいます。）は、本規約を遵守することに同意し、かつ当チームの定める一定の情報（以下、「登録事項」といいます。）を当チームの定める方法で当チームに提供することにより、当チームに対し、本サービスへの登録を申請することができます。 
          (2) 本サービスのユーザーが未成年である場合、事前に法定代理人の同意を得て利用しなければなりません。当チームは、法定代理人に対して、同意の有無を確認する場合がございます。 
          (3) 当チームは、反社会的勢力の構成員（過去に構成員であった方を含みます）及びその関係者の方や、サービスを悪用したり、第三者に迷惑をかけたりするような求人企業に対してはご利用をお断りしています。 
          (4) 当チームは、当チームの基準に従って、第１項に基づいて登録申請を行った登録希望者（以下「登録申請者」といいます。）の登録の可否を判断し、当チームが登録を認める場合にはその旨を登録申請者に通知します。登録申請者の登録ユーザーとしての登録は、当チームが本項の通知を行ったことをもって完了したものとします。 
          (5) 前項に定める登録の完了時に、サービス利用契約が登録ユーザーと当チームの間に成立し、登録ユーザーは本サービスを本規約に従い利用することができるようになります。 
          (6) 当チームは、登録申請者が、以下の各号のいずれかの事由に該当する場合は、登録及び再登録を拒否することがあり、またその理由について一切開示義務を負いません。 
          　A.　当チームに提供した登録事項の全部または一部につき虚偽、誤記または記載漏れがあった場合 
          　B.　未成年者、成年被後見人、被保佐人または被補助人のいずれかであり、法定代理人、後見人、保佐人または補助人の同意等を得ていなかった場合 
          　C.　反社会的勢力等（暴力団、暴力団員、右翼団体、反社会的勢力、その他これに準ずる者を意味します。以下同じ。）である、または資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等反社会的勢力等との何らかの交流もしくは関与を行っていると当チームが判断した場合 
          　D.　過去当チームとの契約に違反した者またはその関係者であると当チームが判断した場合 
          　E.　第3章第3.5条（登録抹消等）に定める措置を受けたことがある場合 
          　F.　その他、登録を適当でないと当チームが判断した場合 
          (7) ユーザーは、本サービスにおいて、1人につき1つのアカウントを保有するものとします。1人が複数のアカウントを保有すること、複数人が1つのアカウントを共同して保有することはできません。 
          第1.7条（登録事項の変更） 
          (1) 登録ユーザーは、登録事項に変更があった場合、当チームの定める方法により当該変更事項を遅滞なく当チームに通知するものとします。 
          第1.8条（パスワード及びユーザーIDの管理） 
          (1) 登録ユーザーは、自己の責任において、本サービスに関する認証用メールアドレス及びパスワード等を適切に管理及び保管するものとし、これを第三者に利用させ、または貸与、譲渡、名義変更、売買等をしてはならないものとします。 
          (2) 認証用メールアドレス及びパスワード等の管理不十分、使用上の過誤、第三者の使用等によって生じた損害に関する責任は登録ユーザーが負うものとします。 
           
          第2章　投稿等・取引等に関する規約 
          第1節　投稿等に関する規約 
          第2.1.1条（投稿等に関する責任） 
          (1) 本サービスの内容は、ユーザー間のテキスト売買やユーザー間のメッセージのやり取り、授業評価に関する投稿、掲示板、学割情報発信、課外イベント情報発信であり、ユーザーは、本規約を遵守の上、自らの意思と責任において、本サービスを行うものとします。 
          (2) 当チームは、投稿等の内容の信頼性、真実性、正確性、妥当性、適法性、完全性、第三者の権利を侵害していないことその他一切の性質について何ら保証するものではありません。 
          (3) また、当チームは、投稿等が本規約に抵触するか否かを積極的に監視する義務を負うものでもありません。 
          第2.1.2条（禁止行為） 
          (1) ユーザーは、本サービスを利用して、次の行為（以下「禁止行為」といいます。）を行わないものとします。 
          (2) 禁止行為に該当する又は該当するおそれがあると当チームが判断した場合、ユーザーの本サービスの以後の利用を禁止するものとします。当チームは、本条に基づき当チームが行った措置に基づきユーザーに損害が生じた場合でも、一切の責任を負わないものとし、ユーザーはこれを了承します。 
          　A.　他人の身体、生命、自由、名誉、財産等に対して害悪を加える旨の内容を投稿等する行為 
          　B.　不倫・援助交際・売春・買春等の勧誘行為 
          　C.　他のユーザーに不快感を与える行為 
          　D.　一般に公開されている情報を除き、電話番号、メールアドレス等の個人的な連絡先を投稿等する行為 
          　E.　他人の名前その他の情報を不正利用した投稿等する行為 
          　F.　異性との出会いを目的とする一切の行為 
          　G.　ユーザーが使用するコンピュータ、スマートデバイス、通信機器等のハードウェア若しくはそれらにインストールされているソフトウェアに何らかの悪影響を生じさせ、又はユーザーに心理的な不快感を与えるようなコンピュータープログラムやファイルをアップロードし、又はそれらのプログラムやファイルが記録されているサーバーにアクセスするURLを掲載し、若しくはかかるサーバーに対するリンクを貼る行為 
          　H.　他人の産業財産権（特許権、商標権等）、著作権、企業秘密等の知的財産権を侵害する行為 
          　I.　他人の信用若しくは名誉を侵害し、又は他人のプライバシー権、肖像権その他一切の権利を侵害する行為 
          　J.　自殺・自傷行為を肯定・勧誘あるいは助長する行為（自殺の方法等を掲載する行為を含みます） 
          　K.　虐待を肯定・勧誘・助長する行為 
          　L.　虚偽又は真実に反し若しくは誤解を招くような内容を投稿等する行為 
          　M.　犯罪行為をすること又はこれを助長するような内容を投稿等する行為 
          　N.　低俗で品位を欠く（例えば猥褻な）内容を投稿等する行為 
          　O.　本サービスの運営又は他のユーザーによる本サービスの利用を妨害し、若しくはそれらに支障をきたす行為 
          　P.　通常利用の範囲を超えてサーバーに負担をかける行為 
          　Q.　無限連鎖講（ねずみ講）、マルチ商法、又はそれに類するもの、その恐れのあるものと当チームが判断する内容を投稿等する行為 
          　R.　政治活動、宗教活動、又はそれに類するもの、その恐れのあるものと当チームが判断する内容を投稿等する行為 
          　S.　営利目的、広告目的の投稿等する行為（カテゴリに即し、当チームが健全と判断するものは除く） 
          　T.　公序良俗に反する行為 
          　U.　法令に反する行為（法令上必要な許認可・登録・届出等を欠いてなされる行為を含む） 
          　V.　他人に対する誹謗中傷、脅迫、嫌がらせ、ストーカー等の行為 
          　W.　自己の出品について購入等する行為 
          　X.　その他当チームが合理的な理由に基づき不適切と判断する行為 
          第2.1.3条（投稿等に関するその他の事項等） 
          (1) ユーザーは、当チームに対し、自らが投稿等をすることについての適法な権利を有していること、投稿等が第三者の権利を侵害しないこと及び投稿等が第2.1.2条に規定される禁止行為に該当しないことについて、表明し、保証するものとします。 
          (2) 当チームが、投稿等を当チームのウェブサイト等において利用及び公開する場合があります。この場合、当チームは、投稿等について、要約、抜粋、サイズ変更又は切り抜きなどの改変等の行為を行う場合があります。 
          (3) 当チームは、本サービス上で当チームが定める方法でユーザー自身が許可した場合を除き、本規約に基づく投稿等の利用を、ユーザー自身を除く、他のユーザーその他の第三者に許諾するものではなく、ユーザーは他のユーザー等の投稿等の権利を侵害する行為を行ってはならないものとします。また、ユーザーは投稿等をクロール等で自動的に収集、解析する行為を行ってはならないものとします。 
          (4) ユーザーは、自らの投稿等を常に正確かつ最新な状態に維持及び保護する責任を負うものとし、当チームは投稿等の維持及び保護について一切責任を負いません。当チームは投稿等の損失又は破壊、投稿等のバックアップ又は復元に関わるコスト若しくは費用については、一切責任を負いません。 
          (5) 当チームは、投稿等が当チームの管理するサーバーに未達の場合、その他通信障害等が生じた場合について、一切責任を負わないものとします。 
          (6) 当チームは、ユーザーが投稿等を利用したこと及び本条に基づき当チームが行った行為によりユーザーに損害が生じた場合でも、一切の責任を負わないものとし、ユーザーはこれを了承します。 
          第2.1.4条（違法投稿等の通報） 
          (1) ユーザーは、他のユーザーの投稿情報が自己または第三者の権利を侵害している場合等、本サービス上の投稿情報が本規約に違反するおそれがあると判断した場合には、当チーム所定の方法に従い、当チームに通報することができるものとします。 
          (2) 当チームは、前項の定めに基づく通報を受けた場合、当チームの裁量に基づき、当該通報の内容が事実であるかの確認を行い、通報の対象となった投稿を行ったユーザーに対して何らの通知も行うことなく、当該投稿情報の削除その他利用停止等の措置を講じることができるものとします。 
          (3) 前二項の定めは、当チームに対し、ユーザーによる通報に応対する義務を負わせるものではありません。 
           
          第2節　取引等に関する規約 
          第2.2.1条（取引等に係る自己責任の原則等） 
          (1) ユーザーは、本サービスを利用して、ユーザー同士で商品・物品・情報・役務提供等に関する有償又は無償の取引、約束、合意等（以下「取引等」といいます。）を行うことができますが、ユーザーは、本規約を遵守の上、自らの責任と判断において取引等を行わなくてはなりません。 
          (2) 本サービスを利用するユーザー間の取引等は、あくまでユーザー間に成立するものであり、当チームはユーザー間の取引等及び取引等に付随する事項には直接の関与をせず、ユーザー間の取引等に関する事項は全てユーザーの自己責任において行われるものとします。 
          (3) 当チームは、ユーザー間の取引等に関する事項について、原則として介入することはなく、ユーザーは取引等に関するトラブルについて当チームに解決を求めることはできません。ただし、当チームは、本サービスの円滑な運営のために必要と判断した場合、ユーザー間のトラブルに介入することがあります。 
          (4) ユーザー間で取引等に関してトラブルが発生した場合、ユーザーの費用と責任によって解決されるものとします。 
          (5) ユーザーは、本サービスを利用して取引等を行うに際し、本規約を遵守するとともに、古物営業法、特定商取引に関する法律、不当景品類及び不当表示防止法、個人情報保護に関する法律、職業安定法、その他の法律、ガイドライン及び業界団体の自主基準及び自主規制等を遵守しなければなりません。 
          第2.2.2条（出品に関する事項） 
          (1) ユーザーは、本サービスを利用した取引等のために、商品・物品・情報・役務提供等（以下「商品等」といいます。）の出品を行う場合、該当するカテゴリにおける当チーム所定の手続・方法に従うものとします。 
          (2) ユーザーは、当チームの指定する「出品禁止物ガイドライン」に記載のある商品等を出品することはできません。当チームは、「出品禁止物ガイドライン」に記載のある商品等に該当する又はそのおそれがあると判断した場合、本規約違反の行為がなされたものとみなすことができるものとし、ユーザーはこれを了承します。 
          (3) 当チームは、本条第2項に定める本規約違反行為がなされた場合又は同項に基づいて本規約違反行為がなされたものとみなされた場合、出品に関する投稿等の削除、出品に対してなされた他のユーザーの投稿等の取消し、削除を行うことができます。 
          (4) 当チームは、ユーザーの出品によって、ユーザー及び第三者に生じる損害について、当チームの故意又は重過失によるものを除き、一切の責任を負わないものとします。 
          第2.2.3条（注文に関する事項） 
          (1) 商品等の出品に対して注文を行うユーザーは、注文の意思のない注文（いたずら目的の注文、注文の繰り返し行為を含みますがそれらに限られません。）をしてはなりません。 
          (2) 当チームは、ユーザーの注文によって、ユーザー及び第三者に生じる損害について、当チームの故意又は重過失によるものを除き、一切の責任を負わないものとします。 
           
          第3章　雑則 
          第3.1条（本サービスの停止等) 
          当チームは、以下のいずれかに該当する場合には、ユーザーに事前に通知することなく、本サービスの全部または一部の提供を停止または中断することができるものとします。 
           
          (1) 本サービスに係るコンピューター・システムの点検または保守作業を緊急に行う場合 
          (2) コンピューター、通信回線等の障害、誤操作、過度なアクセスの集中、不正アクセス、ハッキング等により本サービスの運営ができなくなった場合 
          (3) 地震、落雷、火災、風水害、停電、天災地変などの不可抗力により本サービスの運営ができなくなった場合 
          (4) その他、当チームが停止または中断を必要と判断した場合 
          第3.2条（本サービスの内容の変更・終了） 
          (1) 当チームは、当チームの都合により、本サービスの内容を変更し、または提供を終了することができます。 
          (2) 当チームが本サービスの提供を終了する場合、本アプリケーション上または当チームの運営するウェブサイト上への掲示その他当チームが適当と判断する方法でユーザーに通知するものとします。 
          (3) 当チームは本サービスの終了によりユーザーに生じた損害について一切の責任を負いません。 
          第3.3条（利用者情報の取扱い） 
          (1) 当チームによるユーザーの利用者情報の取扱いについては、別途当チームプライバシーポリシーの定めによるものとし、ユーザーはこのプライバシーポリシーに従って当チームがユーザーの利用者情報を取扱うことについて同意するものとします。 
          (2) 当チームは、ユーザーが当チームに提供した情報、データ等を、個人を特定できない形での統計的な情報として、当チームの裁量で、利用及び公開することができるものとし、ユーザーは予めこれに同意するものとします。 
          第3.4条（権利帰属） 
          (1) 本サービスを構成する有形・無形の構成物（ソフトウエアプログラム，データベース，アイコン，画像，文章，マニュアル等の関連ドキュメント等を含みます）に関する著作権を含む一切の知的財産権，その他の権利は，当チーム又は当チームに承諾した第三者に帰属します。 
          (2) 本規約に基づく本サービスの利用許諾は、当チーム本アプリケーションまたは本サービスに関する当チームまたは当チームにライセンスを許諾している者の知的財産権の使用許諾を意味するものではありません。 
          (3) ユーザーは、投稿データについて、自らが投稿その他送信することについての適法な権利を有していること、及び投稿データが第三者の権利を侵害していないことについて、当チームに対し表明し、保証するものとします。 
          (4) ユーザーは、投稿データについて、当チームに対し、世界的、非独占的、無償、サブライセンス可能かつ譲渡可能な使用、複製、配布、派生著作物の作成、表示及び実行に関するライセンスを付与します。また、投稿データについて他のユーザーが閲覧することについて同意し、他のユーザーに対しても、本サービスを利用してユーザーが投稿その他送信した投稿データの使用、複製、配布、派生著作物を作成、表示及び実行することについての非独占的なライセンスを付与します。 
          (5) ユーザーは、当チーム及び当チームから権利を承継しまたは許諾された者に対して著作者人格権を行使しないことに同意するものとします。 
          第3.5条（登録抹消等） 
          (1) 当チームは、登録ユーザーが、以下の各号のいずれかの事由に該当する場合は、事前に通知または催告することなく、投稿データを削除もしくは非表示にし、当該登録ユーザーについて本サービスの利用を一時的に停止し、または登録ユーザーとしての登録を抹消することができます。 
          　A.　本規約のいずれかの条項に違反した場合 
          　B.　登録事項に虚偽の事実があることが判明した場合 
          　C.　破産手続開始、民事再生手続開始、会社更生手続開始、特別清算開始もしくはこれらに類する手続の開始の申立てがあった場合 
          　D.　6ヶ月以上本サービスの利用がない場合 
          　E.　当チームからの問い合わせその他の回答を求める連絡に対して30日間以上応答がない場合 
          　F.　第2章 第1節 第2.1.2条（禁止行為）に該当する場合 
          　G.　その他、当チームが本サービスの利用または登録ユーザーとしての登録の継続を適当でないと判断した場合 
          (2) 前項各号のいずれかの事由に該当した場合、登録ユーザーは、当チームに対して負っている債務の一切について当然に期限の利益を失い、直ちに当チームに対して全ての債務の支払を行わなければなりません。 
          (3) 理由の如何を問わず、登録ユーザーが本アプリケーションを利用する権利を失った場合、本アプリケーションに関するデジタルコンテンツも同時に利用できなくなることを登録ユーザーはあらかじめ承諾するものとします。 
          (4) 当チームは、本条に基づき当チームが行った行為によりユーザーに生じた損害について一切の責任を負いません。 
          第3.6条（非保証・免責事項） 
          (1) 当チームは、本アプリケーション及び本アプリケーションを通じて提供されるサービスについて、正確性、完全性、有効性、信頼性、安全性、適法性、特定の目的への適合性を含む、事実上又は法律上の一切の不具合がないことにつき、明示的にも黙示的にも保証は行いません。なお、セキュリティ等への欠陥・エラー・バグがないことについても保証しません。 
          (2) 当チームは、本アプリケーションについて次の事項について保証を行いません。 
          　A.　すべての情報端末に対応して正常に動作すること 
          　B.　OS又はバージョンアップ等が行われた場合において正常に動作すること 
          　C.　本アプリケーションストア等を含むプラットフォーマーの運用方針、規約等の変更が行われた場合において正常に動作すること 
          　D.　当チームは、本サービスの利用に関してユーザーが被った損害又は損失などについては、一切の責任を負わないものとします。 
          　E.　当チームは、本サービスの利用に際して、第2.2条（規約等の変更）、第4.1条（本サービス提供の中断）、及び第4.2条（本サービスの終了）があった場合等を含め、ユーザーが被った損害又は損失に対して、一切の責任を負わないものとします。 
          　F.　当チームは、ユーザーが本サービスの利用によって、他のユーザー又は第三者に対して損害を与えた場合、その一切の責任を負わないものとします。 
          　G.　当チームは、ユーザーが本サービスを通じて得る情報などについて、その完全性、正確性、確実性、有用性など、いかなる保証も行わないものとします。 
          　H.　当チームは、投稿等時期、削除、誤配、又は保存・バックアップの有無について何ら責任を負わないものとします。 
          　I.　当チームは、ユーザーが使用するいかなる機器、ソフトウェアについても、その動作保証を一切行わないものとします。 
          　J.　本サービス利用の際に発生した、電話会社又は各種通信業者より請求される接続に関する費用は、ユーザーが自己責任において管理するものとし、当チームは、いかなる保証も行わないものとします。 
          　K.　本サービスから他のウェブサイトへのリンク又は他のウェブサイトから本サービスへのリンクが提供されている場合でも、当チームは、当該ウェブサイト及びそこから得られる情報に関して如何なる理由に基づいても一切の責任を負わないものとします。 
          (3) 当チームはユーザーに対し、前2項にかかる一切の不具合について、当チームの責任と負担で当該不具合の解消を行うことを保証しません。 
          第3.7条（損害賠償の請求） 
          (1) ユーザーによる本規約違反行為その他本アプリケーションの利用に起因して、当チームに直接または間接の損害が生じた場合（当該行為が原因で、当チームが第三者から損害賠償請求その他の請求を受けた場合を含みます。）、ユーザーは当チームに対して、そのすべての損害（弁護士等専門家費用及び当チームにおいて対応に要した人件費相当額を含みます。）を賠償しなければなりません。 
          (2) 当チームの故意又は重大な過失によりユーザーが損害を被った場合、当チームは当チームの行為から直接生じた損害の実額を限度として賠償することがあります。 
          第3.8条（サービス利用契約上の地位の譲渡等） 
          (1) ユーザーは、当チームの書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務につき、第三者に対し、譲渡、移転、担保設定、その他の処分をすることはできません。 
          (2) 当チームは本サービスに係る事業を他社に譲渡した場合には、当該事業譲渡に伴い利用契約上の地位、本規約に基づく権利及び義務並びに登録ユーザーの登録事項その他の顧客情報を当該事業譲渡の譲受人に譲渡することができるものとし、ユーザー及び登録ユーザーは、かかる譲渡につき本項において予め同意したものとします。なお、本項に定める事業譲渡には、通常の事業譲渡のみならず、合併、会社分割等のM&A、その他事業が移転するあらゆる場合を含みます。 
          第3.9条（退会） 
          (1) 登録ユーザーは、当チーム所定の手続の完了により、本サービスから退会し、自己の登録ユーザーとしての登録を抹消することができます。 
          (2) 退会にあたり、当チームに対して負っている債務が有る場合は、登録ユーザーは、当チームに対して負っている債務の一切について当然に期限の利益を失い、直ちに当チームに対して全ての債務の支払を行わなければなりません。 
          (3) 退会後の利用者情報の取扱いについては、第3.10条（秘密保持）に従うものとします。 
          第3.10条（秘密保持） 
          (1) ユーザーは、本サービスに関連して当チームがユーザーに対して秘密に取扱うことを求めて開示した非公知の情報について、当チームの事前の書面による承諾がある場合を除き、秘密に取扱うものとします。 
          第3.11条（業務提携・広告） 
          (1) 本サービスは、当チームの業務提携先（以下「提携パートナー」といいます。）を介して提供されることがあります。この場合、提携パートナーの定める利用規約と本規約が重畳的に適用されます。ただし、ユーザーと当チーム間の権利義務については本規約が優先して適用されます。 
          (2) 本サービスのサイト中の提携パートナー・広告主との取引は、ユーザーと提携パートナー・広告主の責任において行うものとします。当チームはサービス中に掲載されている情報によって行われる取引に起因する損害については一切責任を負いません。 
          (3) 当チームは、本サービスに関し、原則として情報の伝達のみを行うものとし、本サービスに関する情報の作成、本サービス以外の特定のサービス等の勧誘・募集・推奨・営業活動または契約等の締結等の行為は行いません。 
          (4) 当チームは、本サービスにつき、ウェブサイトから提携パートナーに送信する情報が提携パートナーに到達することに関し一切保証いたしません。また提携パートナーからユーザーへの情報提供が行われることに関しましても一切保証いたしません。 
          (5) 当チームは、ユーザーが提携パートナーに行った、本サービス以外の特定のサービスに関する申込み、または申込みのキャンセルを代行することはいたしません。 
          (6) 本条の各項の事項については、提携パートナーとユーザーとの間で交渉・解決していただくものとし、これらの事項に関する電話・訪問・電子メール等によるお問い合わせに当チームが応じることはできません。 
          第3.12条（反社会的勢力等への対応） 
          (1) ユーザーは、本規約の有効期間中、反社会的勢力等に該当しないこと及び反社会的勢力等と関係を持たないことを表明し保証します。 
          (2) ユーザーは、当チーム又は他のユーザーその他の第三者に対し次の各号の一に該当する行為を行ってはなりません。 
          　A.　脅迫的、暴力的又は法的な責任を超えた要求 
          　B.　風説を流布し、偽計を用い又は威力を用いた信用毀損又は業務妨害 
          　C.　その他、前各号に類似するいかなる行為 
          (3) ユーザーが第1項又は第2項に違反していることが判明した場合は、当チームは当該ユーザーの投稿等を削除し、当該ユーザーによる本サービスの使用を停止することができます。 
          (4) ユーザーは、前項の規定により本サービスの使用を停止された場合、当チームに対して何らの損害賠償ないし補償を請求することはできず、また当チームに損害が生じたときはその損害を賠償するものとします。 
          第3.13条（分離可能性） 
          (1) 本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。 
          第3.14条（言語） 
          (1) 利用規約が日本語と日本語以外の言語にて作成された場合、当該利用規約の言語間での矛盾又は相違が生じた場合は、全ての点において日本語を優先するものとします。 
          第3.15条（準拠法） 
          (1) 本規約に関する準拠法は日本法とします。 
          第3.16条（管轄裁判所） 
          (1) ユーザーと当チームとは、本規約に関連する紛争について、その訴額に応じて、神戸地方裁判所 伊丹支部又は伊丹簡易裁判所を第一審の専属的合意管轄裁判所とすることとします。 
          最終更新 
          【2024年4月20日】 
                  '''),
        ), // 이곳에 이용 계약 내용을 넣으세요.
      ),
    );
  }
}
